# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

list = ["Зима", "Весна", "Лето", "Осень"]
dict = {12: "Зима", 1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето",
        9: "Осень", 10: "Осень", 11: "Осень"}

month = -1
while True:
    month = int(input ("Введите номер месяца"))
    if (month <= 12 and month > 0):
        break;

print(dict.get(month))

if month in (12, 1, 2):
    print(list[0])
elif month in (3, 4, 5):
    print(list[1])
elif month in (6, 7,8):
    print(list[2])
elif month in (9, 10, 11):
    print(list[3])
